DR_EXPLAIN.namespace( 'DR_EXPLAIN.data_index' );
DR_EXPLAIN.data_index = {

	// index
	DREX_NODE_KEYWORDS: [31,30,29,28,21,22,20,13,14,15,6,7,4,5,2,3,1,27,26,24,25,23,19,17,18,16,11,12,10,8,9],
	DREX_NODE_KEYWORDS_START: [0,0,1,2,3,4,6,7,10,12,14,16,17,18,19,21,22,23,25,26,28,29], //length:= drex.nodes_count,
	DREX_NODE_KEYWORDS_END: [0,1,2,3,4,6,7,10,12,14,16,17,18,19,21,22,23,25,26,28,29,31], //length:= drex.nodes_count,

	DREX_KEYWORD_NAMES: ["<НОВОЕ КЛЮЧ... Требуется Advanced-лицензия!","Лист регистра... Требуется Advanced-лицензия!","Тер... Требуется Advanced-лицензия!","Обозн... Требуется Advanced-лицензия!","При... Требуется Advanced-лицензия!","Осво... Требуется Advanced-лицензия!","Оши... Требуется Advanced-лицензия!","Аварийные... Требуется Advanced-лицензия!","Пом... Требуется Advanced-лицензия!","Техническа... Требуется Advanced-лицензия!","Наст... Требуется Advanced-лицензия!","Регис... Требуется Advanced-лицензия!","Вх... Требуется Advanced-лицензия!","Главная ... Требуется Advanced-лицензия!","Вы... Требуется Advanced-лицензия!","Опис... Требуется Advanced-лицензия!","Проверка рабо... Требуется Advanced-лицензия!","Дополнительно... Требуется Advanced-лицензия!","Загрузк... Требуется Advanced-лицензия!","Носител... Требуется Advanced-лицензия!","Подго... Требуется Advanced-лицензия!","Назна... Требуется Advanced-лицензия!","Условия п... Требуется Advanced-лицензия!","Эксплуатационн... Требуется Advanced-лицензия!","Уровень п... Требуется Advanced-лицензия!","Требуемы... Требуется Advanced-лицензия!","Возмо... Требуется Advanced-лицензия!","Область п... Требуется Advanced-лицензия!","Введ... Требуется Advanced-лицензия!","Содер... Требуется Advanced-лицензия!","Анно... Требуется Advanced-лицензия!","Начальная... Требуется Advanced-лицензия!"],
	DREX_KEYWORD_CHILD_START: [1,32,32,32,32,32,32,32,32,32,32,32,32,32,32,32,32,32,32,32,32,32,32,32,32,32,32,32,32,32,32,32],
	DREX_KEYWORD_CHILD_END: [32,32,32,32,32,32,32,32,32,32,32,32,32,32,32,32,32,32,32,32,32,32,32,32,32,32,32,32,32,32,32,32]
	
};